import "./index.css";
import img1 from "../../assets/img1.jpg";
import img2 from "../../assets/img2.jpg";
import img3 from "../../assets/img3.jpg";
const ShowCases = () => {
  return (
    <section className="show_case_container">
      <div className="show_case_comp">
        <img src={img1} alt="" />
        <h2>عنوان اول</h2>
        <p>
          لكن لا بد أن أوضح لك أن كل هذه الأفكار المغلوطة حول استنكار النشوة
          وتمجيد الألم نشأت بالفعل، وسأعرض لك التفاصيل لتكتشف حقيقة وأساس تلك
          السعادة البشرية، فلا أحد يرفض أو يكره أو يتجنب الشعور بالسعادة، ولكن
          بفضل هؤلاء الأشخاص الذين لا يدركون بأن السعادة لا بد أن نستشعرها بصورة
          أكثر عقلانية ومنطقية فيعرضهم هذا لمواجهة الظروف الأليمة،
        </p>
      </div>{" "}
      <div className="show_case_comp">
        <h2>عنوان اول</h2>

        <p>
          لكن لا بد أن أوضح لك أن كل هذه الأفكار المغلوطة حول استنكار النشوة
          وتمجيد الألم نشأت بالفعل، وسأعرض لك التفاصيل لتكتشف حقيقة وأساس تلك
          السعادة البشرية، فلا أحد يرفض أو يكره أو يتجنب الشعور بالسعادة، ولكن
          بفضل هؤلاء الأشخاص الذين لا يدركون بأن السعادة لا بد أن نستشعرها بصورة
          أكثر عقلانية ومنطقية فيعرضهم هذا لمواجهة الظروف الأليمة،
        </p>
        <img src={img2} alt="" />
      </div>{" "}
      <div className="show_case_comp">
        <img src={img3} alt="" />
        <h2>عنوان اول</h2>

        <p>
          لكن لا بد أن أوضح لك أن كل هذه الأفكار المغلوطة حول استنكار النشوة
          وتمجيد الألم نشأت بالفعل، وسأعرض لك التفاصيل لتكتشف حقيقة وأساس تلك
          السعادة البشرية، فلا أحد يرفض أو يكره أو يتجنب الشعور بالسعادة، ولكن
          بفضل هؤلاء الأشخاص الذين لا يدركون بأن السعادة لا بد أن نستشعرها بصورة
          أكثر عقلانية ومنطقية فيعرضهم هذا لمواجهة الظروف الأليمة،
        </p>
      </div>
    </section>
  );
};

export default ShowCases;
